In [6]:
import numpy as np
import pandas as pd
#%matplotlib notebook
%matplotlib inline

import the dataset into a dataframe

In [3]:
from google.colab import files
uploaded=files.upload()

Saving Salaries.csv to Salaries.csv

In [10]:
url='https://raw.githubusercontent.com/nimjesm/Python4DS/master/Salaries.csv'
df=pd.read_csv(url)
df

            Id       EmployeeName  ...         Agency  Status
0            1     NATHANIEL FORD  ...  San Francisco     NaN
1            2       GARY JIMENEZ  ...  San Francisco     NaN
2            3     ALBERT PARDINI  ...  San Francisco     NaN
3            4  CHRISTOPHER CHONG  ...  San Francisco     NaN
4            5    PATRICK GARDNER  ...  San Francisco     NaN
...        ...                ...  ...            ...     ...
148649  148650      Roy I Tillery  ...  San Francisco     NaN
148650  148651       Not provided  ...  San Francisco     NaN
148651  148652       Not provided  ...  San Francisco     NaN
148652  148653       Not provided  ...  San Francisco     NaN
148653  148654          Joe Lopez  ...  San Francisco     NaN

[148654 rows x 13 columns]

In [9]:
import io
df=pd.read_csv(io.BytesIO(uploaded['Salaries.csv']))
df

            Id       EmployeeName  ...         Agency  Status
0            1     NATHANIEL FORD  ...  San Francisco     NaN
1            2       GARY JIMENEZ  ...  San Francisco     NaN
2            3     ALBERT PARDINI  ...  San Francisco     NaN
3            4  CHRISTOPHER CHONG  ...  San Francisco     NaN
4            5    PATRICK GARDNER  ...  San Francisco     NaN
...        ...                ...  ...            ...     ...
148649  148650      Roy I Tillery  ...  San Francisco     NaN
148650  148651       Not provided  ...  San Francisco     NaN
148651  148652       Not provided  ...  San Francisco     NaN
148652  148653       Not provided  ...  San Francisco     NaN
148653  148654          Joe Lopez  ...  San Francisco     NaN

[148654 rows x 13 columns]

display the column names

In [11]:
df.columns

Index(['Id', 'EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year', 'Notes', 'Agency',
       'Status'],
      dtype='object')

display the number of rows and cols

In [12]:
df.shape

(148654, 13)

display the dataframe info (types of data in columns and not null values etc.)

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            0 non-null       float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

display stats of the dataframe like count, mean, std, max, 25% etc....

In [15]:
df.describe()

                  Id        BasePay  ...  Notes  Status
count  148654.000000  148045.000000  ...    0.0     0.0
mean    74327.500000   66325.448841  ...    NaN     NaN
std     42912.857795   42764.635495  ...    NaN     NaN
min         1.000000    -166.010000  ...    NaN     NaN
25%     37164.250000   33588.200000  ...    NaN     NaN
50%     74327.500000   65007.450000  ...    NaN     NaN
75%    111490.750000   94691.050000  ...    NaN     NaN
max    148654.000000  319275.010000  ...    NaN     NaN

[8 rows x 10 columns]

display null values per column

In [14]:
df.isnull().sum()

Id                       0
EmployeeName             0
JobTitle                 0
BasePay                609
OvertimePay              4
OtherPay                 4
Benefits             36163
TotalPay                 0
TotalPayBenefits         0
Year                     0
Notes               148654
Agency                   0
Status              148654
dtype: int64

remove columns will all values as NaN

In [15]:
df=df.dropna(thresh=1,axis=1)
df

            Id       EmployeeName  ...  Year         Agency
0            1     NATHANIEL FORD  ...  2011  San Francisco
1            2       GARY JIMENEZ  ...  2011  San Francisco
2            3     ALBERT PARDINI  ...  2011  San Francisco
3            4  CHRISTOPHER CHONG  ...  2011  San Francisco
4            5    PATRICK GARDNER  ...  2011  San Francisco
...        ...                ...  ...   ...            ...
148649  148650      Roy I Tillery  ...  2014  San Francisco
148650  148651       Not provided  ...  2014  San Francisco
148651  148652       Not provided  ...  2014  San Francisco
148652  148653       Not provided  ...  2014  San Francisco
148653  148654          Joe Lopez  ...  2014  San Francisco

[148654 rows x 11 columns]

display number of unique values in each column

In [16]:
df.nunique()

Id                  148654
EmployeeName        110811
JobTitle              2159
BasePay             109489
OvertimePay          65998
OtherPay             83225
Benefits             98465
TotalPay            138486
TotalPayBenefits    142098
Year                     4
Agency                   1
dtype: int64

mean of total pay of all people based on year

In [17]:
df['TotalPay'].agg('mean')

74768.321971703

how many people have 0 overtime pay

In [19]:
(df['OvertimePay']==0).to_list().count(True)

77321

In [20]:
df['OvertimePay'].value_counts()

0.00        77321
681.23         41
10.68          41
152.13         38
1314.78        27
            ...
1629.76         1
22136.39        1
19597.08        1
2924.19         1
2703.14         1
Name: OvertimePay, Length: 65998, dtype: int64

max, min, mean, median and other stats of TotalPay of people having 0 overtimePay

In [25]:
df2=df[df['OvertimePay']==0]
df2.describe()

                  Id        BasePay  ...  TotalPayBenefits          Year
count   77321.000000   76720.000000  ...      77321.000000  77321.000000
mean    77093.868897   59052.468386  ...      76220.693271   2012.513237
std     42958.288642   47958.028112  ...      63310.245056      1.115316
min         1.000000       0.000000  ...       -618.130000   2011.000000
25%     36919.000000   12999.755000  ...      14463.370000   2012.000000
50%     74157.000000   57273.055000  ...      73155.890000   2013.000000
75%    110772.000000   89826.697500  ...     117157.260000   2014.000000
max    148654.000000  319275.010000  ...     567595.430000   2014.000000

[8 rows x 8 columns]

find Id of that person with max TotalPay you got in previous question

In [44]:
df2[df2['TotalPay']==567595.43]

   Id    EmployeeName  ...  Year         Agency
0   1  NATHANIEL FORD  ...  2011  San Francisco

[1 rows x 11 columns]

In [43]:
df2[df2['TotalPay']==567595.43]['Id']

0    1
Name: Id, dtype: int64

name of employee with total pay benefits = 87619.78

In [47]:
df[df['TotalPayBenefits']==87619.78]['EmployeeName']

12345    REBECCA CHIU
Name: EmployeeName, dtype: object

how many people have BasePay > 150000 and OvertimePay > 100000

In [54]:
((df['BasePay']>150000)&(df['OvertimePay']>100000)).to_list().count(True)

12

which job title generally has highest average TotalPayBenefits

In [74]:
df3=df.groupby('JobTitle').mean().sort_values(by='TotalPayBenefits',ascending=False)
df3=df3.reset_index()
df3.iloc[[0]]

                   JobTitle        Id  ...  TotalPayBenefits    Year
0  Chief Investment Officer  110534.0  ...         436224.36  2014.0

[1 rows x 9 columns]

In [76]:
df3['JobTitle'][0]

'Chief Investment Officer'

How many employees are POLICE

In [110]:
df4=df[df['JobTitle'].str.contains('POLICE')]
print('No. of Police is',len(df4.index))

No. of Police is 2512